{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report listing multiple itinerary and UI update requirements referencing specific frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend files including itinerary data, tabs, components, and PWA behavior.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme variables for light/dark mode and applying global background and text styling.",
  "frontend/index.html": "HTML entry point loading main.tsx and registering a service worker for PWA offline support.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, theme colors, start URL, and icons.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy, caching core assets, and managing activation cleanup.",
  "frontend/src/App.tsx": "Main React component managing active tab state and rendering tabs, layout, PWA install banner, and bottom tab bar.",
  "frontend/src/components/BottomTabBar.tsx": "Bottom navigation bar with four Hindi-labeled tabs and active state styling using lucide-react icons.",
  "frontend/src/components/Footer.tsx": "Footer showing Instagram attribution with icon and external link.",
  "frontend/src/components/Layout.tsx": "Layout wrapper with header branding, gradient background, main content area, and footer.",
  "frontend/src/components/PwaInstallPromptBanner.tsx": "Install prompt banner showing iOS or standard instructions, with dismiss and install actions.",
  "frontend/src/config/monetization.ts": "Exports WhatsApp number and utility to generate message-encoded WhatsApp URLs.",
  "frontend/src/data/dwarkaGuide.ts": "Defines TypeScript interfaces and provides multi-day Dwarka travel itineraries with places, timings, and optional recommendation cards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity via React Query, recreating it when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for login, logout, identity loading, and status management using Dfinity AuthClient.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Provides logic to detect PWA installability, handle beforeinstallprompt events, and trigger or dismiss the install prompt.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes and Dwarka-themed colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/tabs/ConnectivityTab.tsx": "Renders transport options from Ahmedabad to Dwarka along with a monetized car/bike rental card and WhatsApp booking link.",
  "frontend/src/tabs/RulesTimingsTab.tsx": "Displays temple rules, prohibited items, timings, and general guidelines using data from dwarkaGuide.",
  "frontend/src/tabs/StayFoodTab.tsx": "Renders categorized stay and food options using hardcoded data, displaying Dharamshala, mid‑range, luxury hotels, and best food lists with styled cards.",
  "frontend/src/tabs/YatraPlanTab.tsx": "Implements a day selector and displays multi-day itineraries as a timeline with times, places, descriptions, and Google Maps links.",
  "frontend/src/utils/googleMaps.ts": "Provides a helper function that generates a Google Maps search URL for a given place in Dwarka.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, radius, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Describes the project’s state, requirements, offline constraints, issues, and feature definitions for the Dwarka Yatra Guide PWA."
}