{
  "backend/main.mo": "Defines an empty Motoko actor with no exposed methods.",
  "feature_evidence.json": "JSON report stub indicating no features listed yet.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend source files.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark OKLCH color tokens and global styles.",
  "frontend/index.html": "Main HTML entry registering the PWA service worker and loading the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, icons, colors, and standalone display mode.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy and asset caching for offline use.",
  "frontend/src/App.tsx": "Main React component managing active tab state and rendering layout, tabs, PWA banner, and navigation bar.",
  "frontend/src/components/BottomTabBar.tsx": "Bottom navigation bar with four Hindi-labeled tabs and icon-based tab switching.",
  "frontend/src/components/Footer.tsx": "Footer showing Instagram credit link for The Desi Musafir.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper with Hindi header branding, feather icon, and global footer.",
  "frontend/src/components/PwaInstallPromptBanner.tsx": "Banner prompting users to install the PWA, with iOS and Android-specific instructions.",
  "frontend/src/config/monetization.ts": "Centralized WhatsApp contact configuration and helper to generate chat links.",
  "frontend/src/data/dwarkaGuide.ts": "Defines itinerary data models and full multi-day Dwarka travel plans with optional recommendation cards.",
  "frontend/src/hooks/useActor.ts": "React hook creating an authenticated or anonymous backend actor and refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider to manage Internet Identity authentication using AuthClient, exposing identity, login state, and login/clear actions.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Defines a hook that captures the PWA install prompt event, tracks installability, handles iOS behavior, and exposes prompt and dismiss functions.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines extensive light/dark theme CSS variables including custom Dwarka color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/tabs/ConnectivityTab.tsx": "Renders transport options from Ahmedabad to Dwarka plus a monetized car/bike rental card with WhatsApp booking.",
  "frontend/src/tabs/RulesTimingsTab.tsx": "Displays temple rules, prohibited items, timings, and general guidelines using themed UI components.",
  "frontend/src/tabs/StayFoodTab.tsx": "Shows lodging and food options categorized into budget, mid‑range, luxury, and best food places using styled cards.",
  "frontend/src/tabs/YatraPlanTab.tsx": "React component rendering a Hindi Yatra Plan tab with a day selector and timeline-style itinerary using local hardcoded data. Includes Google Maps links and UI cards for each day's plan.",
  "frontend/src/utils/googleMaps.ts": "Utility function that builds a Google Maps search URL for a place in Dwarka by encoding the place name.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing Hindi offline-first Dwarka Yatra PWA requirements, current issues, and feature list for planning and fixes."
}