{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Metadata describing a feature request to remove an image property from a specific Day 3 recommendation card.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of key frontend files and components.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Main HTML entry with PWA manifest, meta tags, root div, and service worker registration.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, colors, orientation, and icons.",
  "frontend/public/sw.js": "Service worker implementing cache-first offline strategy with cache version v2.",
  "frontend/src/App.tsx": "Root component managing active tab state and rendering tabs, layout, PWA banner, and bottom bar.",
  "frontend/src/components/BottomTabBar.tsx": "Bottom navigation bar with four tabs and active-state styling.",
  "frontend/src/components/Footer.tsx": "Footer showing Instagram credit link for @the_desi.musafir.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing header branding, main content area, and footer.",
  "frontend/src/components/PwaInstallPromptBanner.tsx": "Install banner showing PWA install instructions and actions for iOS and Android.",
  "frontend/src/components/recommendation/Badge.tsx": "Badge component rendering an icon and label with fixed orange styling and top-right positioning.",
  "frontend/src/components/recommendation/Card.tsx": "Recommendation card displaying optional image, title, subtitle, description, and child elements.",
  "frontend/src/config/monetization.ts": "Exports WhatsApp number and URL generator for booking or contact links.",
  "frontend/src/data/dwarkaGuide.ts": "Defines interfaces for itinerary and recommendation data and exports structured multi‑day Dwarka travel plans.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, stored identity loading, and logout handling.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Implements logic to detect PWA installability, handle the beforeinstallprompt event, and manage prompt display state.",
  "frontend/src/index.css": "Sets global Tailwind styles and defines custom light/dark CSS variables including a Dwarka theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/tabs/ConnectivityTab.tsx": "Renders connectivity info from Ahmedabad to Dwarka along with a rental service promo and transport tables.",
  "frontend/src/tabs/RulesTimingsTab.tsx": "Displays temple rules, prohibited items, timings, and general guidelines using styled cards and alerts.",
  "frontend/src/tabs/StayFoodTab.tsx": "Renders stay and food options using categorized cards populated from stayFoodData with styled lists.",
  "frontend/src/tabs/YatraPlanTab.tsx": "Provides a day selector and displays corresponding itinerary timelines with map links using local data.",
  "frontend/src/utils/googleMaps.ts": "Generates a Google Maps search URL by encoding a place name with a Dwarka location suffix.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Stores the project’s current state, requirements, known issues, and architectural notes for ongoing development."
}