{
  "kind": "build_request",
  "title": "Update offline Yatra Plan content (Day 2 Beyt Dwarka step, reorder Day 3, add highlighted Sanskruti Novelty card with placeholder image)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Update the local Day 2 itinerary data to insert a new step immediately after the existing “Cross Sudarshan Setu / सुदर्शन सेतु” step: place text must be exactly “📍 बेट द्वारका मुख्य मंदिर दर्शन (Beyt Dwarka Temple Darshan)” and it must include an important note/description exactly “ध्यान दें: मंदिर दोपहर 1:00 बजे से 3:00 बजे तक बंद रहता है।” including the timing context “(Timings: 9 AM - 1 PM & 3 PM - 6 PM)” as part of the same step’s note.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "After \"Cross Sudarshan Setu\", explicitly add a step: \"📍 **बेट द्वारका मुख्य मंदिर दर्शन** (Beyt Dwarka Temple Darshan)\".\nAdd an important note there: \"ध्यान दें: मंदिर दोपहर 1:00 बजे से 3:00 बजे तक बंद रहता है।\" (Timings: 9 AM - 1 PM & 3 PM - 6 PM)."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/data/dwarkaGuide.ts, the Day 2 plan under the 2-day and 3-day itineraries contains a new item directly after the “सुदर्शन सेतु” item.",
        "The inserted item’s place text matches exactly: “📍 बेट द्वारका मुख्य मंदिर दर्शन (Beyt Dwarka Temple Darshan)”.",
        "The inserted item’s note/description includes exactly the provided closure note in Hindi and also includes the provided English timing context string.",
        "No backend/canister calls are introduced; content remains fully local/offline."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Reorder the local Day 3 itinerary flow so the sequence is reversed to match: Morning—“📍 द्वारका मार्केट में खरीदारी (Dwarka Market Shopping)”; Afternoon—“📍 पोरबंदर के लिए प्रस्थान (Travel to Porbandar - Kirti Mandir & Sudama Mandir)”; Evening—“वापसी या विश्राम (Return/Relax)”. Remove/replace any conflicting older Day 3 items so the displayed Day 3 timeline reflects this exact order and text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Reorder Day 3 Itinerary Flow (Morning Shopping first):\nMorning (सुबह): 📍 द्वारका मार्केट में खरीदारी (Dwarka Market Shopping).\nAfternoon (दोपहर): 📍 पोरबंदर के लिए प्रस्थान (Travel to Porbandar - Kirti Mandir & Sudama Mandir).\nEvening (शाम): वापसी या विश्राम (Return/Relax)."
        ]
      },
      "acceptanceCriteria": [
        "Selecting “3 दिन” in the Yatra Plan tab shows Day 3 items in the exact requested order: Shopping (morning) → Porbandar travel (afternoon) → Return/Relax (evening).",
        "The three Day 3 place strings match the requested strings exactly (including the “📍” where provided).",
        "The old Day 3 order/content is no longer shown."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add a special highlighted recommendation card inside the Day 3 “Shopping” section (i.e., rendered within the Shopping timeline item content) with these exact texts: Title “📸 फोटो और 3D स्टूडियो (Recommended)”; Shop Name “संस्कृति नॉवेल्टी (पुरुषोत्तम भाई मच्छर)”; Location “द्वारकाधीश मंदिर से वॉकिंग डिस्टेंस (Walking Distance from Temple).”; Details “द्वारकाधीश के सभी प्रकार के लाइटिंग फोटो और 3D फोटो के लिए सबसे अच्छी और किफायती (वाजिब दाम) जगह।” The card must be visually distinct from normal text (highlighted styling).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Inside the Day 3 \"Shopping\" section, add a SPECIAL HIGHLIGHTED CARD for photos.\nTitle: \"📸 फोटो और 3D स्टूडियो (Recommended)\"\nShop Name: \"संस्कृति नॉवेल्टी (पुरुषोत्तम भाई मच्छर)\"\nLocation: \"द्वारकाधीश मंदिर से वॉकING डISTANCE (Walking Distance from Temple).\"\nDetails: \"द्वारकाधीश के सभी प्रकार के लाइटिंग फोटो और 3D फोटो के लिए सबसे अच्छी और किफायती (वाजिब दाम) जगह।\""
        ]
      },
      "acceptanceCriteria": [
        "When viewing Day 3, the Shopping timeline item contains a clearly highlighted card section (distinct border/background) showing the exact four text fields requested.",
        "The highlighted card appears only within the Day 3 Shopping item (not as a separate day or separate unrelated section).",
        "All existing navigation and offline behavior remain unchanged (no new API/canister dependencies)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Within the highlighted “Sanskruti Novelty” recommendation card, include a placeholder image area that uses a generic placeholder URL (not yet a real shop photo) so the layout is correct.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "include a PLACEHOLDER image area to show where the shop photo will appear. (Use a generic placeholder URL for now so the layout is correct)."
        ]
      },
      "acceptanceCriteria": [
        "The highlighted recommendation card renders an image slot (e.g., <img> or background image block) above or beside the text.",
        "The image slot uses a placeholder URL value sourced from local data/config so it can be replaced later without changing component layout code.",
        "The placeholder does not break offline-first UX (the UI remains usable even if the placeholder cannot be fetched)."
      ]
    }
  ],
  "constraints": [
    "All itinerary content must remain bundled as local/hardcoded frontend data (no canister/API calls required for these updates).",
    "Do not modify any files under frontend/src/components/ui or any frontend.immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep the app functional offline; changes must not introduce runtime failures when the network/backend is unavailable."
  ],
  "nonGoals": [
    "Do not add a Hindi–English language toggle (not requested in the active scope).",
    "Do not change Connectivity, Stay & Food, or Rules & Timings content beyond what is necessary for the requested itinerary/card updates.",
    "Do not implement real shop photo upload/storage; only a placeholder image area is required."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}