{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Sanskruti Novelty recommendation card image data and ensure text-only rendering",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Remove the image reference from the Day 3 recommendation card data object for \"संस्कृति नॉवेल्टी (पुरुषोत्तम भाई मच्छर)\" so it has no image property present in source or derived data.",
      "acceptanceCriteria": [
        "The Day 3 recommendation card data object for \"संस्कृति नॉवेल्टी (पुरुषोत्तम भाई मच्छर)\" contains no `image` key/property at all (it is not present in the source).",
        "No other code re-adds an `image` field to that object at build/runtime (no derived/merged data introduces it)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/dwarkaGuide.ts",
          "operation": "modify",
          "description": "Locate the Day 3 itinerary item's recommendationCard for shopName \"संस्कृति नॉवेल्टी (पुरुषोत्तम भाई मच्छर)\" and completely delete the image property line from that object (in current data this is stored as `placeholderImage`; remove the entire property line rather than setting to null/empty). Update the RecommendationCard typing to allow the image field to be absent so TypeScript does not require re-adding it."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Ensure the Sanskruti Novelty Day 3 recommendation card renders with no image container or <img>, showing only title/subtitle/description (plus existing badge).",
      "acceptanceCriteria": [
        "When viewing Day 3 in the Yatra Plan tab, the Sanskruti Novelty recommendation card shows only title, subtitle, and description (plus the existing Recommended badge if already present).",
        "There is no `<img>` element rendered for this card and no empty/placeholder image container is present in the DOM for this card."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tabs/YatraPlanTab.tsx",
          "operation": "modify",
          "description": "Update recommendation card rendering so the Card component is only given an image prop when an image field exists, and explicitly ensure the shopName \"संस्कृति नॉवेल्टी (पुरुषोत्तम भाई मच्छर)\" never receives an image prop (so the Card component does not render any image wrapper for this card)."
        }
      ]
    }
  ]
}